content/blog/automating-chkdsk-scans-using-powershell-with-email-alerts-for-rmm/index.org
#+title: Automating Chkdsk Scans Using Powershell With Email Alerts for Rmm
#+date: 2024-08-22T20:44:38-07:00
#+draft: false

* What this does
Automatically schedules windows filesystem checks if the drive is detected to
have corruption. If corruption occurs more than once per week, an email is sent
out to your desired address. SFC & DISM scans are scheduled for 10PM. CHKDSKs on
the corrupt drive are scheduled for 12AM

This can be run standalone, although ideally you set it up as an automatic
response in your RMM software. There are failsafes in place to prevent the
script from running multiple times due to alert spam.

**Important**: A python EXE file is used to send the emails out. The source code
to script is on my github [[https://github.com/peterunix/Python-Sendmail][LINK]]. The build in this project is compiled from that.

* How to implement with RMM
- Edit the script and add your SMTP credentials on the last line.
- Add this script as a component in your RMM
- Update your RMM and have the script be a response to the following event
  errors

#+begin_src
Get-EventLog -LogName System -EntryType Error -Source Ntfs -Message "A corruption was discovered in the file system structure on volume*" -ErrorAction 'SilentlyContinue'
Get-EventLog -LogName System -EntryType Error -Source Disk -Message "The device, *has a bad block*" -ErrorAction 'SilentlyContinue'
Get-EventLog -LogName System -EntryType Error -Source Disk -Message "The driver detected a controller error on*" -ErrorAction 'SilentlyContinue'
#+end_src

* Running standalone
You can schedule this to run automatically on your PC through the task
scheduler. My suggestion is have it run daily at some arbitrary hour.

