public/blog/windows/automating-chkdsk-scans-using-powershell-with-email-alerts-for-rmm/index.html
<!DOCTYPE html>
<html lang="en">
<head>  <meta charset="UTF-8">
  <title>Queztaz/Automating Chkdsk Scans Using Powershell With Email Alerts for Rmm</title>
  <meta name="viewport" content="width=device-width, initial-scale=1">
  <link rel="stylesheet" href="/css/gtd.css">
  
  
</head>
<body>
  
<main>
  <div style="margin: 1rem;">
    <a href="/" style="
      display: inline-block;
      background-color: #eee;
      color: #333;
      padding: 0.4rem 0.8rem;
      border-radius: 6px;
      text-decoration: none;
      font-weight: bold;
      font-family: sans-serif;
      font-size: 0.9rem;
    ">
      ← Homepage
    </a>

  <h1>Automating Chkdsk Scans Using Powershell With Email Alerts for Rmm</h1>

  </div>
  <nav class="toc">
    <nav id="TableOfContents">
<ul>
<li><a href="#headline-1">What this does</a>
</li>
<li><a href="#headline-2">How to implement with RMM</a>
</li>
<li><a href="#headline-3">Running standalone</a>
</li>
<li><a href="#headline-4">Source Code</a>
</li>
</ul>
</nav>
  </nav> 

  <article>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
What this does
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>Automatically schedules windows filesystem checks if the drive is detected to
have corruption. If corruption occurs more than once per week, an email is sent
out to your desired address. SFC &amp; DISM scans are scheduled for 10PM. CHKDSKs on
the corrupt drive are scheduled for 12AM</p>
<p>
This can be run standalone, although ideally you set it up as an automatic
response in your RMM software. There are failsafes in place to prevent the
script from running multiple times due to alert spam.</p>
<p>
<strong><strong>Important</strong></strong>: A python EXE file is used to send the emails out. The source code
to script is on my github <a href="https://github.com/peterunix/Python-Sendmail">LINK</a>. The build in this project is compiled from that.</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
How to implement with RMM
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<ul>
<li>Edit the script and add your SMTP credentials on the last line.</li>
<li>Add this script as a component in your RMM</li>
<li>Update your RMM and have the script be a response to the following event
errors</li>
</ul>
<div class="src src-text">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-text" data-lang="text"><span style="display:flex;"><span>Get-EventLog -LogName System -EntryType Error -Source Ntfs -Message &#34;A corruption was discovered in the file system structure on volume*&#34; -ErrorAction &#39;SilentlyContinue&#39;
</span></span><span style="display:flex;"><span>Get-EventLog -LogName System -EntryType Error -Source Disk -Message &#34;The device, *has a bad block*&#34; -ErrorAction &#39;SilentlyContinue&#39;
</span></span><span style="display:flex;"><span>Get-EventLog -LogName System -EntryType Error -Source Disk -Message &#34;The driver detected a controller error on*&#34; -ErrorAction &#39;SilentlyContinue&#39;</span></span></code></pre></div>
</div>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
Running standalone
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p>You can schedule this to run automatically on your PC through the task
scheduler. My suggestion is have it run daily at some arbitrary hour.</p>
</div>
</div>
